src/cf/Documents/ЗаявкаНаМедосмотр.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЗаявкаНаМедосмотр</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пациент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пациенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайнийСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/РеестрЗаявокНаМедосмотр.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РеестрЗаявокНаМедосмотр</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗаявки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайнийСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаключениеМедКомиссии</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаключениеМедицинскойКомиссии</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Просрочена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаМедосмотр</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаМедосмотр</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пациент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пациенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/Пациенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Пациенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Documents/ЗаявкаНаМедосмотр/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий		  
		  
Процедура ПередЗаписью(Отказ)
	
	Если Пациент.Пустая() Тогда
		ЗаполнитьПациента();
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ ЗначениеЗаполнено(КрайнийСрок) Тогда
		Отказ = Истина;
		ВызватьИсключение "Не заполнен крайний срок";
	КонецЕсли;	
	
	МЗ = РегистрыСведений.РеестрЗаявокНаМедосмотр.СоздатьМенеджерЗаписи();
	МЗ.ЗаявкаНаМедосмотр = Ссылка;
	МЗ.Пациент 			 = Пациент;
	
	МЗ.Прочитать();
	Если НЕ МЗ.Выбран() 
		ИЛИ (МЗ.ЗаключениеМедКомиссии.Пустая()
		И НЕ МЗ.Просрочена) Тогда
		
		МЗ.ЗаявкаНаМедосмотр = Ссылка;
		МЗ.Пациент 			 = Пациент;
		МЗ.ДатаЗаявки  = Дата;
		МЗ.КрайнийСрок = КрайнийСрок;
		МЗ.Записать();

	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции		  
		  
Процедура ЗаполнитьПациента()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пациенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пациенты КАК Пациенты
	|ГДЕ
	|	Пациенты.Фамилия = &Фамилия
	|	И Пациенты.Имя = &Имя
	|	И Пациенты.Отчество = &Отчество
	|	И Пациенты.ДатаРождения = &ДатаРождения";
	
	Запрос.УстановитьПараметр("Фамилия"     , Фамилия);
	Запрос.УстановитьПараметр("Имя"         , Имя);
	Запрос.УстановитьПараметр("Отчество"    , Отчество);
	Запрос.УстановитьПараметр("ДатаРождения", ДатаРождения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		НовыйПациент = Справочники.Пациенты.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НовыйПациент, ЭтотОбъект);
		НовыйПациент.Записать();
		Пациент = НовыйПациент.Ссылка;
	Иначе	
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Пациент = Выборка.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
